app/Helper/constant_helper.php

    function CHECK_RIGHTS_TO_ACCESS_DENIED($module_id,$authuserId)
    {
    	$authId=$authuserId;
    	$right=\App\Models\Right::find($authId->right_id);
    	$module_data=\App\Models\RightModule::where('status',\App\Models\RightModule::STATUS_ACTIVE)->where('right_id',$right->id)->pluck('module_id')->toArray();
---
select `module_id` from `right_modules` where `status` = '1' and `right_id` = 1

    function getMailCredential()
    {
        $data=\App\Models\MailCredential::where('status','1')->find('1');
---
select * from `mail_credentials` where `status` = '1' and `mail_credentials`.`id` = '1' limit 1