app/Http/Controllers/HomeController.php

    public function index()
    {
        $banner = \App\Models\Banner::where('status',\App\Models\Banner::STATUS_ACTIVE)->get();
---
select * from `banners` where `status` = '1'