app/Models/Contactus.php

    public function storeFrontContactUs($r){

      $setting = GET_SETTINNG_DATA();
      $errors="";
      $input = $r->all();

      $obj = new self;
      $obj->name = $input['name'];
      $obj->email = $input['email'];
      $obj->message = $input['message'];
      $obj->subject = $input['subject'];
      $obj->save();

      if ($obj !=null) {
        $mailcredential=getMailCredential();
        if($mailcredential != null ){

        $data  = \App\Models\EmailTemplate::where('title','send_mail_to_user_for_contact_us')->where('status',1)->first();
---
select * from `email_templates` where `title` = 'send_mail_to_user_for_contact_us' and `status` = 1 limit 1

          }
        }

        $adminEmail  = \App\Models\EmailTemplate::where('title','send_mail_to_admin_for_contact_us')->where('status',1)->first();
---
select * from `email_templates` where `title` = 'send_mail_to_admin_for_contact_us' and `status` = 1 limit 1